public class EvenNumbers {
    public static void main(String[] args) {
        // Задача 1 - цикл, выводящий на экран чётные цифры из диапазона от 2 до 10 включительно.
        for (int i=2; i<=10; i+=2) {
            System.out.println(i);
        }
    }
}
